/*
Практика №1
Задание:
1. Написать Вашу первую функцию myFirstFunction(), которая выводит окно с предупреждением "Я родился!".
*/

/////////////////
function myFirstFunction() {// Ключевое слово function, название функции myFirstFunction и список передаваймых параметров (данных, он сейчас пустой).
    alert("Я родился!")// Тело функции, происходит вызов функции alert(), которая в свою очередь выводит диалоговое окно с текстом "Я родился!"
                        // Функция ничего не возвращает, поэтому в данном примере нам можно не использовать ключевое слово return.
}
/////////////////

/*
2. Сохранить скрипт, загрузить страницу.
3. Что произошло?!
-- Ничего не произошло. Мы написали функцию, но ничего с ней не сделали, ее надо вызвать!
4. Вызвать функцию.
*/

/////////////////
myFirstFunction();// Вызываем нашу функцию.
/////////////////

/*
5. Сохранить скрипт, загрузить страницу.
*/


