/*
Практика №3
Задание:
1. Напишите функцию поиска факториала factorial(num) от числа.
n! = n * (n - 1)!
0! = 1
1! = 1
2! = 2 * 1 = 2
3! = 3 * 2 * 1 = 6
4! = 4 * 3 * 2 * 1 = 24
5! = 5 * 4 * 3 * 2 * 1 = 120
*/

/////////////////






/////////////////

/*
2. Внутри функции alert() вызовите Вашу функцию поиска факториала для числа 5.
*/

/////////////////

/////////////////

/*
3. Внутри функции alert() вызовите Вашу функцию поиска факториала для числа 10000.
*/

/////////////////

/////////////////

/*
4. Внутри функции alert() вызовите Вашу функцию поиска факториала для числа 100000.
*/

/////////////////

/////////////////

/*
5. Сохранить скрипт, загрузить страницу.
6. Что произошло при вычислении факториала для числа 10000?
7. Что произошло при вычислении факториала для числа 100000?
8. Откройте консоль (инструменты) разработчика (F12), прочитайте ошибку. Что она значит? 
*/