/*
Практика №2
Задание:
1. Написать Вашу вторую функцию mySecondFunction(), которая будет получать имя, а возвращать приветствие с ним.
*/

/////////////////




/////////////////

/*
2. Создать переменную myMessage, в которой будем хранить полученное приветствие. 
3. Записать послание.
4. Вызвать встроенную функицю alert() и вывести сообщение.
*/

/////////////////


/////////////////

/*
5. Сохранить скрипт, загрузить страницу.
6. Не работает?! Что о чем говорит данное сообщение? 
7. Передайте в функцию mySecondFunction() Ваше имя и повторите пункты 4-5.
*/