

function init() {
    //В данной функции реализуется то, что делается программой один раз
    //Т.е. подготовительная часть для последующей симуляции "Жизни"
}

function startSimulation() {
    // В данной функции реализуется циклическая часть программы
}

function main() {
    // Из данной функции происходит вызов всех остальных функции
    // Сама функция main() вызывается браузером после загрузки страницы 
    // благодаря <body onload="main()">
}


function name(params) {
    // Имя -- обязательная уникальная составляющая, задается как и для переменных, по тем же правилам
    // Параметры -- не обязательная часть, служит для получения информации

    /*Тело функции -- не обязательная часть, но если ее нет, стоит подумать, а зачем мы все это делаем?!) */
    
    return // Служит для возвращения значений и завершения функции, не обязательная часть
}